/*
學號:1102160
姓名:陳廷岳
完成日期:2025/03/03
檔名:D2160PrgHw02_02.CPP
程式功能:計算薪水 
*/

#include<stdio.h>
#include<stdlib.h>

int main()
{
	int T, pay;				//定義工時與薪水 
	
	printf("輸入工時");			//輸入工時 
	scanf("%d",&T);
	//printf("T=%d\n",T);
	if(T<=10)									//如果工時小於10小時 
	{
		pay=160*T;								//小於10小時的薪水算法 
	}
	else
	{
		if(T<=40)								//如果工時大於40小時 
		{
			pay=(160*1.2*(T-10)+160*10);		// 大於40小時的薪水算法 
		}
		else
		{
			if(T>=41)							//如果工時大於41小時 
			{
				pay=(160*1.34*(T-40)+160*1.2*40+160*10);	//大於41小時的薪水算法 
			}
		}
	}
	printf("薪水為%d\n", pay);					//輸出薪水結果 
	
	system("pause");
	return 0;
}
