/*===================================================================== 
學號:1102160
姓名:陳廷岳 
完成日期:2025/03/10
檔名:D2160PrgHW03_3.CPP
程式功能:九九乘法表
===================================================================== */ 

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	
	int x, y, n;									//定義變數乘數、被乘數、行數 
	
	for(n=1; n<=9; n+=3)							   	// 每行3組乘法 
	{
		for(y=1; y<=9; y++)							//乘數為1每次加1最多成9次 
		{
			for(x=n; x<n+3; x++)						//被乘數為1每次加1根據行數終止 
			{
				printf("%d*%d=%2d \t", x, y, x*y);			//輸出算式結果 
			}
		printf("\n");								//換行 
		}
	printf("------------------------- \n");
	}
	
	system("pause");
	return 0;
}
