/*===================================================================== 
學號:1102160
姓名:陳廷岳 
完成日期:2025/03/10
檔名:D2160PrgHW03_1.CPP
程式功能:(1)計算計算1~200中，計算6的倍數的總合 
		 (2)計算1~200中，可以被3或8整除，且不可被24整除的所有整數的總合 
		 (3) 計算 π的近以值
===================================================================== */ 


#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	
	int x, sum=0;							//定義(1)的變數與總和 
	
	for(x=0; x<=200; x+=6)						//初始為0每次加6不超過200 
	{
		sum+=x;							//計算總和 
	}


	int x2, sum2=0;							// 定義(2)的變數與總和 
	
	for(x2=0; x2<=200; x2++)					//初始為0每次加1不超過200 
	{
		if((x2%3==0 || x2%8==0) && x2%24!=0)			//可被3或8整除，且不被24整除的所有整數
		sum2+=x2;						//計算總和 
	}
		
	printf("sum(1)=%d \n",sum);					//輸出(1)、(2)的結果 
	printf("sum(2)=%d \n",sum2);
	
	
	int x3, sum3=0;							// 定義(3)的變數與總和 
	
	for(x3=1; x3<=50; x3++)						//初始為1每次加1不超過50 
	{
		sum3+=pow((-1),(x3+1))*pow(x3,2);			//計算總和 
	}
	
	printf("sum3=%d \n",sum3);					//輸出(3)結果 
	
	system("pause");
	return 0;
	
	
	system("pause");
	return 0;
	
}


